Repository: bitpatroon/bpn_expiring_fe_users
Catalog: Resources/Private/Language/*.locallang_db.xlf
Languages: nl

# scheduler.title
source: Expiring Frontend Users
nl: Verlopende front-end gebruikers

# scheduler.description
source: Executes all enabled Expiring Frontend Users configuration records
nl: Voert alle verlopende gebruiker configuraties uit

# tt_content.list_type_pi1
source: Account Extender
nl: Account verlenger

# tx_bpnexpiringfeusers_config
source: Expiring Frontend Users Configuration
nl: Verlopende Frontend Users Configuratie

# tx_bpnexpiringfeusers_config.todo
source: Action
nl: Actie

# tx_bpnexpiringfeusers_config.todo.I.0
source: Choose an action to perform
nl: Kies een actie

# tx_bpnexpiringfeusers_config.todo.I.1
source: Send e-mail to users
nl: Stuur een e-mail naar gebruikers

# tx_bpnexpiringfeusers_config.todo.I.2
source: Disable users
nl: Gebruikers uitschakelen

# tx_bpnexpiringfeusers_config.todo.I.3
source: Delete users (users will remain in database)
nl: Gebruikers verwijderen (gebruikers blijven in het systeem)

# tx_bpnexpiringfeusers_config.todo.I.4
source: Remove usergroup from users
nl: Verwijder een gebruikersgroep van een gebruiker

# tx_bpnexpiringfeusers_config.todo.I.5
source: Set users to expire after X days
nl: Laat de gebruikers na X dagen verlopen

# tx_bpnexpiringfeusers_config.disabled
source: Disabled
nl: Uitgeschakeld

# tx_bpnexpiringfeusers_config.testmode
source: Testmode No changes, just logging.
nl: Testmodus. Geen wijzingen alleen logging.

# tx_bpnexpiringfeusers_config.limiter
source: The number of affected users per run
nl: Het aantal gebruikers per run

# tx_bpnexpiringfeusers_config.title
source: Title
nl: Titel

# tx_bpnexpiringfeusers_config.sysfolder
source: Folder(s) where the fe_users are stored
nl: Gebruikers opslag map

# tx_bpnexpiringfeusers_config.memberOf
source: AND User must be a member of: (select none for all users in above selected folder(s))
nl: EN de gebruiker is lid van de groep: (Leeglaten selecteert alle gebruikers in bovenstaande map)

# tx_bpnexpiringfeusers_config.andor
source: How should the groups selected above be treated, AND or OR?
nl: Of een van beide (OF) of allebei (EN)

# tx_bpnexpiringfeusers_config.noMemberOf
source: AND User must NOT be a member of
nl: EN gebruiker mag geen lid zijn van

# tx_bpnexpiringfeusers_config.expiringGroup
source: AND One of these groups is about to expire.
nl: EN een van de volgende groepen gaat verlopen.

# tx_bpnexpiringfeusers_config.groupsToRemove
source: Remove these groups from user
nl: Verwijder deze groepen van de gebruiker

# tx_bpnexpiringfeusers_config.andor_not
source: How should the groups selected above be treated, AND or OR?
nl: Bovenstaande groepen allebei (EN) of een van (OF)

# tx_bpnexpiringfeusers_config.conditions
source: Conditions: All (AND)
nl: Condities: Alle (EN)

# tx_bpnexpiringfeusers_config.condition1
source: User has not logged in for X #days
nl: Gebruiker is niet ingelogd sinds in...

# tx_bpnexpiringfeusers_config.condition2
source: Account older than X #days
nl: Account is ouder dan...

# tx_bpnexpiringfeusers_config.condition3
source: Account is disabled
nl: Account is uitgeschakeld

# tx_bpnexpiringfeusers_config.condition4
source: Account expires within X #days
nl: Account verloopt in ... (#dagen)

# tx_bpnexpiringfeusers_config.condition5
source: Account is expired
nl: Account is verlopen

# tx_bpnexpiringfeusers_config.condition6
source: Account has been expired for X #days
nl: Account is inmiddels verlopen ... (#dagen)

# tx_bpnexpiringfeusers_config.condition7
source: Account has never logged in
nl: Account is nooit gebruikt (geen inlog)

# tx_bpnexpiringfeusers_config.condition8
source: Account has no expiration date set
nl: Account heeft geen verlopende einddatum

# tx_bpnexpiringfeusers_config.condition20
source: Above selected group expires within.. (Must select a group in the "AND This group is about to expire." field)
nl: Bovenstaande geselecteerde groepen verlopen in .. (Gebuik met conditie "groep gaat verlopen")

# tx_bpnexpiringfeusers_config.days
source: #days
nl: #dagen

# tx_bpnexpiringfeusers_config.email_test
source: E-mail Test Address (If entered, all e-mails will be sent to this address instead of the real user address. Also actions like setting expire date will not be performed.)
nl: E-mail Address test (Als ingevoerd, dan worden alle berichten naar get ingevulde adres gestuurd! Acties als het aanpassen van de verloopdatum worden niet toegepast.)

# tx_bpnexpiringfeusers_config.email_fromName
source: E-mail Sender Name
nl: E-mail Afzender naam

# tx_bpnexpiringfeusers_config.email_from
source: E-mail Sender Address
nl: E-mail adres afzender

# tx_bpnexpiringfeusers_config.email_bcc
source: BCC E-mail Address: (Send a BCC of all e-mails sent to this address as well)
nl: BCC E-mail adres (Zet dit adres in het BCC voor alle e-mails)

# tx_bpnexpiringfeusers_config.email_subject
source: E-mail Subject
nl: E-mail onderwerp

# tx_bpnexpiringfeusers_config.email_text
source: E-mail Bodytext: (###NAME### for users name) (###LINK### When extend link is enabled; ###URI### adds the link itself) (Only for Group expires within: ###GROUPNAMES###)
nl: E-mail bodytext: (###NAME### voor de naam van de gebruiker) (###LINK### De verleng link, mits geactiveerd; ###URI### zet alleen de link) (Verlopende groepsnaam: ###GROUPNAMES###)

# tx_bpnexpiringfeusers_config.expires_in
source: Automatically set account to expire in: (in days) (set to 0 to not automatically expire)
nl: Automatisch instellen dat een account verloopt in (#dagen). (0 om niet automatisch te verlopen)

# tx_bpnexpiringfeusers_config.reactivate_link
source: Replace ###LINK### marker with link to
nl: Vervang ###LINK### marker met link

# tx_bpnexpiringfeusers_config.reactivate_link.I.0
source: Dont add link
nl: Link niet toevoegen

# tx_bpnexpiringfeusers_config.reactivate_link.I.1
source: Extend account
nl: Account verlengen

# tx_bpnexpiringfeusers_config.reactivate_link.I.20
source: Extend group (probably want to use this when using Group expires within condition)
nl: Verlend groep (Zet als een "verlopende groep conditie aanstaat)

# tx_bpnexpiringfeusers_config.extend_by
source: Extend by: (in days). Its best to not change this after users have been mailed. This is also used to calculate if its been long enough ago to mail users again
nl: Verlengen met (#dagen). Niet veranderen nadat berichten verzonden zijn. Wordt tevens gebruikt bij het berekenen wanneer e-mail opnieuw moet worden verzonden.

# tx_bpnexpiringfeusers_config.page
source: Full URL to the Page where the Extend plugin resides (REQUIRED when adding Extend link.) (Example: http://www.example.com/extend/)
nl: Volledige URL naar de verleng pagina. (Benodigd wanneer de verleng link wordt ingevoegd.) (Example: http://www.example.com/extend/) De volledige URL van de pagina waar de verleng plugin staat (VERPLICHT als er een verlenglink wordt aangeboden.) (Bijvoorbeeld: http://www.example.com/extend/) Volledige URL naar de verleng pagina. (Benodigd wanneer de verleng link wordt ingevoegd.) (Example: http://www.example.com/extend/)

# tx_bpnexpiringfeusers_config.allmatchingusers
source: These users match the currently configured conditions
nl: De volgende gebruikers voldoen aan de gestelde criteria

# tx_bpnexpiringfeusers_config.nextmatchingusers
source: These users match the currently configured conditions. (These users will be affected on next run)
nl: De volgende gebruikers voldoen aan de gestelde criteria en de actie wordt toegepast tijdens de volgende run.

# tx_bpnexpiringfeusers_config.log
source: Log
nl: Logboek

# tx_bpnexpiringfeusers_config.excludesummer
source: Exclude in the summer (July / August)
nl: Uitsluiten in de zomer maanden (juli en augustus)

# mailAction.extendby
source: Extend the account
nl: Verleng het account

# mailAction.or-copy-paste
source: or copy and paste in the browser
nl: of kopieer en plak in de browser

# scheduler.title
source: Process expiring users
nl: Verwerk verlopende gebruikers
